import { Block } from '~/common/components';
import { Accordion } from '~/common/components/Accordion';

export const ServicesBlock = () => {

  return (
    <Block className='services-block'>
      <h2>Что входит в услугу по созданию дизайна интернет-магазина?</h2>
      <Accordion title='Дизайн портала'>
        Дизайн портала — это оформление контента, совокупность всех графических элементов на веб-странице. Основная задача дизайна — познакомить пользователя со страницей. Продуманный дизайн создает нужное впечатление о компании.
      </Accordion>

      <Accordion title='Дизайн адаптивной мобильной версии'>
        Мобильная версия сайта удобна для пользователя, потому что сильно упрощена по сравнению с обычной версией. Мобильная версия позволяет совершать заказ/покупку с минимумом действий.
        При адаптивной версии вся структура сайта автоматически подстраивается под различную ширину экрана.
      </Accordion>

      <Accordion title='Дизайн десктопной версии'>
        Десктопную версию сайта просматривают пользователи со стационарных компьютеров. Основная цель: посерфить, углубиться в детали, получить больше информации, сравнить, выбрать, прицениться.
      </Accordion>

      <Accordion title='Пользовательский интерфейс'>
        Цель дизайна пользовательского интерфейса - сделать взаимодействие максимально простым и эффективным, насколько это возможно, с точки зрения достижения целей пользователя.
      </Accordion>

      <Accordion title='Микро UX'>
        Микро-анимация может изменить восприятие продукта, пользовательское поведение и повысить конверсию. Небольшие, преимущественно функциональные анимации поддерживают пользователя: обеспечивают визуальную обратную связь и более понятно отражают происходящие изменения.
      </Accordion>

      <img className='bag' src='public/bag.149.png'/>
    </Block>
  );
}